<a href="https://colab.research.google.com/github/oyuka1112/oyuka1112/blob/main/dataset1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
import pandas as pd
from matplotlib import pyplot as plt

In [266]:
#import all the files
contacts = pd.read_excel(r'Df_contacts.txt.xlsx')  #.set_index("CONT_ID") #set index as ID 
mails= pd.read_excel(r'Df_mails.xlsx')  #.set_index("MAIL_ID")
responses= pd.read_excel(r'Df_responses.xlsx')  #.set_index("RESPONSE_ID")
conversions= pd.read_excel(r'Df_conversion.xlsx')  #.set_index("CONV_ID")

# New Section

In [199]:
contacts.tail()

     CONT_ID          NAME        CITY STATE   ZIP5
195      196  SHAWN LITTLE  MOORESTOWN    NY  85268
196      197  ALBIN NELSON  ORANGEBURG    IA  93704
197      198  STEVE GOEREE   SOUTHLAKE    AL  50125
198      199   JOAN BURILL    CARLSBAD    FL  21401
199      200  JOHN MCNULTY        LULA    FL  77338

In [69]:
mails.tail()

     MAIL_ID  CONT_ID  MAIL_MONTH  MAIL_DATE
295      296        4          10 2015-10-23
296      297       41           5 2017-05-14
297      298       49          12 2016-12-16
298      299      120           7 2018-07-21
299      300      150          12 2018-12-22

In [70]:
responses.tail()

     RESPONSE_ID  MAIL_ID  RESP_DATE
195          196      234 2019-04-22
196          197      272 2019-03-18
197          198       18 2019-12-18
198          199      198 2019-12-17
199          200       47 2019-03-18

In [71]:
conversions.tail()

    CONV_ID  RESPONSE_ID  CONV_DATE
45       46          170 2020-06-01
46       47           24 2020-11-08
47       48           78 2020-07-24
48       49          182 2020-03-03
49       50           43 2020-12-26

In [ ]:
mails.sort_values(by = "MAIL_DATE", axis = 0 )

         CONT_ID  MAIL_MONTH  MAIL_DATE
MAIL_ID
91            45           1 2015-01-01
191           94           1 2015-01-22
216          145           1 2015-01-23
276           55           2 2015-02-04
32           193           2 2015-02-06
...          ...         ...        ...
37           198          12 2018-12-14
99            65          12 2018-12-15
76            40          12 2018-12-19
53           142          12 2018-12-22
300          150          12 2018-12-22

[300 rows x 3 columns]

In [45]:
df1 = pd.merge(conversions, responses  , on=['RESPONSE_ID'], how='inner').sort_values('RESPONSE_ID')
# df1 = conversions.set_index('RESPONSE_ID').join(responses.set_index('RESPONSE_ID')).sort_index()

In [46]:
df2 = pd.merge(df1, mails  , on=['MAIL_ID'], how='inner').sort_values('MAIL_ID')


#df2 = df1.set_index('MAIL_ID').join(mails.set_index('MAIL_ID')).sort_index()

In [49]:
df3 = pd.merge(df2, contacts  , on=['CONT_ID'], how='inner').sort_values("CONT_ID").sort_index()

In [165]:
df4 = df3['CONT_ID'].drop_duplicates()

In [66]:
df4 = df4.drop(columns = ['CONV_ID', 'RESPONSE_ID', 'MAIL_ID', 'RESP_DATE', 'CONT_ID', 'MAIL_MONTH', 'CITY', 'STATE', 'ZIP5'])

In [73]:
df4.tail()

    CONV_DATE  MAIL_DATE             NAME
45 2020-03-26 2015-03-19  ERNESTO MATHEWS
46 2020-03-03 2015-10-07       PING RENGA
47 2020-11-28 2018-06-08     MICHAEL RAUB
48 2020-05-04 2015-04-26          J SOLIS
49 2020-05-03 2018-12-22      MARIA COYLE

In [257]:
#Ex 8
names = contacts['NAME']
names = names.to_frame()
names = names['NAME'].str.split(',',expand = True).add_prefix('NAME')
contacts['FIRST NAME'] = names['NAME0'].str.split().str[0].astype(str, errors='ignore')
contacts['LAST NAME'] = names['NAME0'].str.split().str[-1].astype(str, errors='ignore')

In [236]:
# names = names.drop('NAME1', axis = 1)

In [245]:
# contacts.rename(columns={0: "NAME"}).drop(columns = 1)
# names = names.rename(columns={'NAME0': "NAME"})
# names = names.drop(columns = 'NAME', axis = 1)
# names

In [258]:
#Ex 9
contacts_only_MD = contacts[contacts.STATE =='MD']
contacts_only_MD

     CONT_ID               NAME       CITY STATE   ZIP5 FIRST NAME  LAST NAME
57        58  JOE COVEY LANDERS  URBANDALE    MD  11801        JOE    LANDERS
120      121    ROBERT LUNDGREN    SHAWNEE    MD  23227     ROBERT   LUNDGREN
125      126  PATRICK STALLINGS  CHARLOTTE    MD   5476    PATRICK  STALLINGS
162      163      MICHAEL HOUCK  SOUTHAVEN    MD  11729    MICHAEL      HOUCK
164      165        JAMES HEITZ      JENKS    MD  93727      JAMES      HEITZ
184      185          JOE ALERS   NEW BERN    MD   3031        JOE      ALERS
185      186         USA PEGORS  EL DORADO    MD  97504        USA     PEGORS

In [281]:
# responses.info()
#Date is in datetime
dt = responses['RESP_DATE']
import datetime
def date_convert(date_to_convert):
     return datetime.datetime.strptime(date_to_convert, '%b %d, %Y').strftime('%m/%d/%Y')

responses['RESP_DATE']= responses['RESP_DATE'].apply(date_convert)

TypeError: ignored